app/controllers/comments_controller.rb

	def create
		@recipe = Recipe.find(params[:recipe_id])
		@comment = @recipe.comments.create(comment_params)
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", 11]]
INSERT INTO "comments" ("commenter", "body", "recipe_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "Peanut Butter Lover"], ["body", "I love this thank you!!"], ["recipe_id", 11], ["created_at", "2015-11-21 07:51:19.806509"], ["updated_at", "2015-11-21 07:51:19.806509"]]