app/controllers/personals_controller.rb

	def index
		@personals = Personal.all.order('created_at DESC')
---
SELECT "personals".* FROM "personals"  ORDER BY created_at DESC

	def show
		@personal = Personal.find(params[:id])
---
SELECT  "personals".* FROM "personals" WHERE "personals"."id" = ? LIMIT 1  [["id", 2]]

	def create
		@personal = Personal.new(personal_params)

		if @personal.save
---
INSERT INTO "personals" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", ""], ["text", ""], ["created_at", "2016-04-24 07:04:22.466015"], ["updated_at", "2016-04-24 07:04:22.466015"]]

	def destroy
  		@personal = Personal.find(params[:id])
  		@personal.destroy
---
SELECT  "personals".* FROM "personals" WHERE "personals"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "personals" WHERE "personals"."id" = ?  [["id", 3]]