app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes"
---
	def index
	    @recipe = Recipe.all

INSERT INTO "recipes" ("title", "category", "preptime", "ingredients", "directions", "calories", "fats", "carbs", "protein", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@recipe = Recipe.new(recipe_params)

  		if @recipe.save