app/controllers/workouts_controller.rb

SELECT "workouts".* FROM "workouts"  ORDER BY created_at DESC
---
	def index
		@workouts = Workout.all.order('created_at DESC')

SELECT  "workouts".* FROM "workouts" WHERE "workouts"."id" = ? LIMIT 1  [["id", 2]]
---
	def show
		@workout = Workout.find(params[:id])

SELECT  "workouts".* FROM "workouts" WHERE "workouts"."id" = ? LIMIT 1  [["id", 1]]
---
	def edit
		@workout = Workout.find(params[:id])

INSERT INTO "workouts" ("body", "date", "log", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "asdf"], ["date", "asdf"], ["log", "asdf"], ["created_at", "2016-03-29 01:56:50.140799"], ["updated_at", "2016-03-29 01:56:50.140799"]]
---
	def create
		@workout = Workout.new(workout_params)

		if @workout.save

SELECT  "workouts".* FROM "workouts" WHERE "workouts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "workouts" SET "date" = ?, "updated_at" = ? WHERE "workouts"."id" = ?  [["date", "4/5/2017"], ["updated_at", "2016-04-05 09:03:53.156544"], ["id", 20]]
---
	def update
  		@workout = Workout.find(params[:id])

  		if @workout.update(workout_params)

SELECT  "workouts".* FROM "workouts" WHERE "workouts"."id" = ? LIMIT 1  [["id", 8]]
DELETE FROM "workouts" WHERE "workouts"."id" = ?  [["id", 8]]
---
	def destroy
  		@workout = Workout.find(params[:id])
  		@workout.destroy